# этот файлик умеет вычислять процент от двух чисел
# удобно считать процент сибтых шахедов

"""
- Библиотека "РусЯз" -
В одном файле (чтоб запускалось и на телефоне)
Всю программу писать после этой вставки.
"""
# 
"""
Пользительные ссылки, которых могло бы и не быть ;)
 https://letpy.com/handbook/builtins/open/
 https://digitology.tech/docs/python_3/library/functions.html
"""

# Переименованные функции
ввод = input
вывод = print

абсолютное_значение = abs
все = all
любой = any
двоичное_представление = bin
булево_значение = bool
символ = chr
комплексное_число = complex
словарь = dict
каталог = dir

деление_с_остатком = divmod
перечислить = enumerate
вычислить_выражение = eval
выполнить = exec
фильтровать = filter
число_с_плавающей_точкой = float
отформатировать = format
получить_атрибут = getattr
содержит_атрибут = hasattr
хеш_код = hash
шестнадцатеричное_представление = hex
идентификатор = id

целое_число = int
является_экземпляром = isinstance
является_подклассом = issubclass
итератор = iter
длина = len
список = list
локальные_переменные = locals
отображение = map
максимальное_значение = max
минимальное_значение = min
следующий = next
восьмеричное_представление = oct
открыть_файл = open
код_символа = ord
возведение_в_степень = pow

свойство = property
диапазон = range
строковое_представление = repr
обратный = reversed
округление = round
множество = set
установить_атрибут = setattr
среза = slice
отсортировать = sorted

строка = str
сумма = sum
базовый_класс = super
кортеж = tuple
тип = type
переменные = vars
зип = zip

"""
Всю программу писать после этой вставки.
Дальше - тело программы ;)
"""

число1 = 42  # сбито
число2 = 130 # прилетело 

вывод (число1 / число2 * 100)

print ("конец") #ага. Можно использоват стандартные функции!!!






